# DAY 1 HOMEWORK
#
# 名前：

# 1. 以下のコードを実行してください。
# 最後にmassとageがどれくらいなっていますか？

mass <- 47.5
age <- 122
mass <- mass * 2.3
age <- age - 20

# 答え：

# 2. 「ape」というRパッケージはDNA解析に使う。
# apeパッケージをインストールするコードを下に書いて、
# インストールしてください。
#
# 答え：：

# 3. apeパッケージにFASTAファイルを読み込む関数、read.FASTA()が
# 備えている。apeパッケージをロードしてから、
# read.FASTA()を使って、Chiba-1-trnL.fastaを読み込んでください
# ヒント：パッケージのロードを忘れないでください
#
# 答え：

# 4. Chiba-1-trnL.fastaに入っているシーケンス（DNA配列）の長さ
# はどれくらい（何塩基）でしょうか？
#
# 答え：

# 5. read_excel()にn_maxという、読み込む列の最大の数を設定する引数がある。
# n_maxを使って、4_全生物種リスト(BLAST結果10位まで).xlsxから
# 1から10列目までを読み込んでください。
#
# 答え：